sedfoam-master/tutorials/laminar/1DStokesBL/constant/kineticTheoryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      kineticTheoryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kineticTheory   off;

equilibrium     off;

e               e [ 0 0 0 0 0 0 0 ] 0.8;

alphaMax        alphaMax [ 0 0 0 0 0 0 0 ] 0.635;

alphaMinFriction alphaMinFriction [ 0 0 0 0 0 0 0 ] 0.57;

DiluteCut       DiluteCut [ 0 0 0 0 0 0 0 ] 0.00001;

ttzero          ttzero [ 0 0 1 0 0 0 0 ] 0;

ttone          ttone [ 0 0 1 0 0 0 0 ] 0;

MaxTheta       MaxTheta [ 0 2 -2 0 0 0 0 ] 1e-1;

Fr              Fr [ 1 -1 -2 0 0 0 0 ] 0.05;

eta             eta [ 0 0 0 0 0 0 0 ] 3;

p               p [ 0 0 0 0 0 0 0 ] 5;

phi             phi [ 0 0 0 0 0 0 0 ] 32.0;

psi             psi [ 0 0 0 0 0 0 0 ] 0.0;

KineticJ1      KineticJ1 [ 0 0 0 0 0 0 0 ] 1; //turn off the viscous dissipation

KineticJ2       KineticJ2 [ 0 0 0 0 0 0 0] 0;

KineticJ3       KineticJ3 [ 0 0 0 0 0 0 0] 0;

viscosityModel  Syamlal;//Gidaspow;

conductivityModel Syamlal;//Gidaspow;

granularPressureModel Lun;

frictionalStressModel SrivastavaSundaresan;

radialModel     CarnahanStarling;

HrenyaSinclairCoeffs
{
    L               L [ 0 1 0 0 0 0 0 ] 0.0005;
}


// ************************************************************************* //
