sedfoam-master/tutorials/laminar/1DStokesBL/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.005;

vertices
(
    (0   -1 0)
    (0    0 0)
    (0    1 0)
    (0.1 -1 0)
    (0.1  0 0)
    (0.1  1 0)
    (0   -1 0.1)
    (0    0 0.1)
    (0    1 0.1)
    (0.1 -1 0.1)
    (0.1  0 0.1)
    (0.1  1 0.1)
);

blocks
(
    hex (0 3 4 1 6 9 10 7) (1 50 1) simpleGrading (1 1 1)
    hex (1 4 5 2 7 10 11 8) (1 50 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    bottom
    {
        type wall;
        faces
        (
            (0 3 9 6)
        );
    }

    top
    {
        type wall;
        faces
        (
            (2 8 11 5)
        );
    }

    inlet
    {
        type cyclic;
        neighbourPatch outlet;
        faces
        (
            (9 3 4 10)
            (10 4 5 11)
        );
    }

    outlet
    {
        type cyclic;
        neighbourPatch inlet;
        faces
        (
            (0 6 7 1)
            (1 7 8 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
